<script>
import Header from "@/components/landing/Header.vue";
import Modal from "@/components/landing/Modal.vue"
import Features from "@/components/landing/Features.vue";
import Section from "@/components/landing/Section.vue";
import ProgramGrid from "@/components/landing/Programs/ProgramGrid.vue";
import About from "@/components/landing/About.vue";
import Cards from "@/components/landing/Cards.vue";
import Banner from "@/components/landing/Banner.vue";
import Form from "@/components/landing/Form.vue";
import Footer from "@/components/landing/Footer.vue";

export default {
  name: 'LandingView',
  components: {
    Form, Banner, Header, Cards, About, ProgramGrid, Section, Features, Modal, Footer,
  },
  data() {
    return {
      isModalOpen: false,
      isPolicyOpen: false,
      isNotificationOpen: false,
    }
  },
}
</script>

<template>
  <Header @openModal="isModalOpen = true">
    <div class="column">
      <span class="title">Уральский Университет Управления и Права</span>
      <span class="subtitle">Автономная некоммерческая организация дополнительного профессионального образования</span>
    </div>
    <div class="column shorten">
      <span class="title">УУУиП</span>
      <span class="subtitle">АНО ДПО</span>
    </div>
  </Header>

  <Banner @openModal="isModalOpen = true">
    <h1 style="font-size: 2.5rem">Переподготовка<br> и повышение квалификации</h1>
    <p>Очно, заочно, дистанционно!</p>
  </Banner>

  <Features
    style="padding: 8rem 0"
    :features="[
        {
          icon: 'house-laptop',
          title: 'Дистанционное обучение',
          text: 'Без выезда в Екатеринбург, можно совмещать с семьей и работой'
        },
        {
          icon: 'graduation-cap',
          title: 'Обучение после 9&nbsp;и&nbsp;11 классов',
          text: 'В любом возрасте, с любым базовым образованием'
        },
        {
          icon: 'file-certificate',
          title: 'удостоверение, диплом  с занесением в базу ФРДО',
          text: 'Государственная лицензия и аккредитация',
          link: '#docs'
        },
        {
          icon: 'arrows-spin',
          title: 'Непрерывная программа колледж&nbsp;+&nbsp;ВУЗ',
          text: 'Перезачет дисциплин, поступление по внутренним экзаменам',
          link: '#collegevuz'
        },
    ]"
  />

  <Section title="Переподготовка или Повышение квалификации" id="programs">
    <p>C указанием любой профессиональной дисциплины в соответствии с ФГОС для преподавателей ВПО, СПО, ДПО и общего развития</p>
    <ProgramGrid
      @click="isModalOpen = true"
      :programs="[
        {
          title: 'Информационные технологии в менеджменте (экономике, юриспруденции)',
          list: ['Повышение квалификации'],
          subtitle: 'от 32 часов',
          icon: 'graduation-cap'
        },
        {
          title: 'Юриспруденция по профессиональной дисциплине',
          list: ['Повышение квалификации'],
          subtitle: 'от 32 часов',
          icon: 'graduation-cap'
        },
        {
          title: 'Экономика по профессиональной дисциплине',
          list: ['Переподготовка', 'Повышение квалификации'],
          subtitle: 'от 32 часов',
          icon: 'graduation-cap'
        },
        {
          title: 'Менеджмент по профессиональной дисциплине',
          list: ['Переподготовка', 'Повышение квалификации'],
          subtitle: 'от 32 часов',
          icon: 'graduation-cap'
        },
        {
          title: 'Психология по профессиональной дисциплине',
          list: ['Повышение квалификации'],
          subtitle: 'от 32 часов',
          icon: 'graduation-cap'
        },
        {
          title: 'Общеобразовательные дисциплины',
          list: ['Повышение квалификации'],
          subtitle: 'от 16 до 256 часов',
          icon: 'graduation-cap'
        },
        {
          title: 'Бережливое производство (управление)',
          list: ['Переподготовка', 'Повышение квалификации'],
          subtitle: 'от 144 до 1080 часов',
          icon: 'graduation-cap'
        },
        {
          title: 'Финансовая грамотность',
          list: ['Переподготовка', 'Повышение квалификации'],
          subtitle: 'от 32 часов',
          icon: 'graduation-cap'
        },
        {
          title: 'Менеджмент в образовании',
          list: ['Переподготовка', 'Повышение квалификации'],
          subtitle: 'от 32 часов',
          icon: 'graduation-cap'
        },
        {
          title: 'Противодействие коррупции',
          list: ['Повышение квалификации'],
          subtitle: 'от 32 часов',
          icon: 'graduation-cap'
        },
        {
          title: 'Противодействие терроризму и экстремизму',
          list: ['Повышение квалификации'],
          subtitle: 'от 16 до 256 часов',
          icon: 'graduation-cap'
        },
        {
          title: 'Русский язык и культура речи',
          list: ['Повышение квалификации'],
          subtitle: 'от 72 до 256 часов',
          icon: 'graduation-cap'
        },
        {
          title: 'Переподготовка кадров',
          list: ['По запросу заказчика', 'По любым направлениям'],
          subtitle: 'от 4 месяцев до 1 года',
          icon: 'graduation-cap'
        },
        {
          title: 'Повышение квалификации',
          list: ['По запросу заказчика', 'По любым направлениям', 'Индивидуальная траектория освоения'],
          subtitle: 'от 16 часов ',
          icon: 'graduation-cap'
        },
        {
          title: 'Популярные программы',
          list: ['Ораторское мастерство', 'Моббинг', 'Командообразование', 'Игропрактики', 'Деловые коммуникации'],
          subtitle: 'от 16 часов до 6 месяцев',
          icon: 'graduation-cap'
        },
        {
          title: 'Иностранные языки',
          list: ['Английский', 'Немецкий', 'Итальянский', 'Китайский'],
          subtitle: 'от 3 месяцев',
          icon: 'graduation-cap'
        },
      ]"
    />
  </Section>

  <Section title="Об университете">
    <About
      :points="[
            {
              number: 'от 3 000 ₽',
              subtitle: 'за 16 часов обучения'
            },
            {
              number: '8+',
              subtitle: 'лет в сфере обучения'
            },
            {
              number: '1 000+',
              subtitle: 'студентов УУУиП'
            },
            {
              number: '33+',
              subtitle: 'программ обучения'
            }
      ]"
    >
      <p class="about__text">
        <b>Уральский Университет Управления и Права</b>
        динамично развивающаяся образовательная организация с бессрочной государственной лицензией. За 8 лет плодотворной работы мы накопили богатый опыт в образовательной сфере и выпустили более 1000 квалифицированных специалистов.
      </p>
    </About>
  </Section>

  <Section title="Как поступить">
    <Features
      style="margin-top: 4rem"
      :features="[
        {
          icon: 'globe-pointer',
          title: 'Оставь заявку',
          text: 'Оставьте заявку и наши специалисты свяжутся с вами!'
        },
        {
          icon: 'file',
          title: 'Подай документы онлайн',
          text: 'Электронная подача документов без выезда в Екатеринбург'
        },
        {
          icon: 'file-signature',
          title: 'Пройди оформление',
          text: 'Заключение договора на обучение в офисе или дистанционно.'
        },
        {
          icon: 'graduation-cap',
          title: 'Обучайся в Уральском Университете Управления и Права',
          text: 'Выбирай мастер-класс, повышение квалификации или переподготовку кадров! Приступайте к обучению и успехов!'
        },
    ]"
    />
  </Section>

  <Section title="Лицензия" id="docs">
    <p style="margin-top: 2rem">Посмотреть нашу бессрочную лицензию Вы можете на сайте <a href="уууэип.рф">уууэип.рф</a></p>
    <Cards
      :cards="[
          {
            title: 'Лицензия',
            subtitle: '№19382 от 28.04.2017',
            image: 'license.png',
            link: 'https://уууэип.рф/uploadedFiles/files/litsenziya_UUUEiP.jpg'
          },
      ]"
    />
  </Section>

  <div class="blackSection">
    <Section title="Поступай в Уральский Университет Управления и Права. Идет набор!" class="blackSection__card">
      <Form @openPolicy="isPolicyOpen = true" @submit="isNotificationOpen = true; isModalOpen = false"/>
    </Section>
  </div>

  <Footer @openPolicy="isPolicyOpen = true"/>

  <Modal
    v-model:isOpen="isModalOpen"
    title="Получить консультацию"
    width="450px"
  >
    <Form @openPolicy="isPolicyOpen = true" @submit="isNotificationOpen = true; isModalOpen = false"/>
  </Modal>

  <Modal
    v-model:isOpen="isPolicyOpen"
    title="Политика конфиденциальности"
    width="450px">
    <p style="font-size: 1rem; line-height: 120%">
      Ваша конфиденциальность очень важна для нас. Мы хотим, чтобы Ваша работа в Интернет по возможности была максимально приятной и полезной, и Вы совершенно спокойно использовали широчайший спектр информации, инструментов и возможностей, которые предлагает Интернет. Персональные данные, собранные при регистрации (или в любое другое время) преимущественно используется для подготовки Продуктов или Услуг в соответствии с Вашими потребностями. Ваша информация не будет передана или продана третьим сторонам. Однако мы можем частично раскрывать личную информацию в особых случаях, описанных в данной Политике конфиденциальности. Рамки Политики конфиденциальности Настоящая Политика конфиденциальности (далее — «Политика») применяется к информации, полученной через данный сайт, иные сайты, виджеты и другие используемые интерактивные средства, на которых есть ссылка на данную Политику (далее — «Сайт») от пользователей Сайта (далее — «Пользователи»). Нижеследующие правила описывают, как Уральский колледж экономики и права обращается с любой информацией, относящейся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных) (далее — «Персональные данные»), для целей оказания услуг с использованием Сайта. Пользователи включают в себя всех физических лиц, которые подключаются к Сайту и используют Сайт. Пользователи прямо соглашаются на обработку своих Персональных данных, как это описано в настоящей Политике. Обработка означает любое действие (операцию) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с Персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), блокирование, удаление, уничтожение Персональных данных. Настоящая Политика конфиденциальности действует с 03 марта 2016 г. Контролирующие и обрабатывающие лица Пользователи соглашаются с тем, что: Пользуясь Сайтом, и принимая условия использования, опубликованные на Сайте, пользователь заявляет о своем однозначном согласии с обработкой его Персональных данных способами, описанными в настоящей Политике. Обработка Персональных данных Пользователей осуществляется Оператором персональных данных — Уральский колледж экономики и права (ИНН: 6685123001, ОГРН: 1169600003550). С какой целью собираются эти данные: Имя используется для обращения лично к вам, а ваш e-mail для отправки вам писем рассылок, новостей тренинга, полезных материалов, коммерческих предложений. Вы можете отказаться от получения писем рассылки и удалить из базы данных свои контактные данные в любой момент, кликнув на ссылку для отписки, присутствующую в каждом письме. Сбор Персональных данных При регистрации на Сайте Пользователи подтверждают свое согласие с условиями настоящей Политики и свое согласие на обработку своих Персональных данных в соответствии с условиями настоящей Политики, кроме того они соглашаются на обработку своих Персональных данных на серверах Уральского колледжа экономики и права, расположенных на территории Российской Федерации. Обработка Персональных данных осуществляется не дольше, чем этого требуют цели обработки Персональных данных, изложенные в настоящей Политике (за исключением случаев, предусмотренных законодательством Российской Федерации). Уральский колледж экономики и права может обрабатывать следующие Персональные данные: адрес электронной почты и иную контактную информацию; сообщения, направляемые с использованием Сайта, и сообщения, направляемые в Уральский колледж экономики и права; иную информацию о взаимодействии Пользователя с Сайтом Уральского колледжа экономики и права, результаты сбора статистики посещений Сайта Уральского колледжа экономики и правп и общедоступной информации о программах и устройствах, используемых для такового доступа; дополнительную информацию, которую Уральский колледж экономики и права запрашивает у Пользователей для удостоверения их личности. Как эти данные используются На сайте используются куки
    </p>
  </Modal>

  <Modal
    v-model:isOpen="isNotificationOpen"
    title="Заявление принято"
    width="450px"
  >
    Мы свяжемся с Вами в ближайшее время
  </Modal>
</template>

<style scoped lang="scss">

.blackSection {
  background-color: #333333;
  display: flex;
  justify-content: center;
  padding: 2rem 5%;
  border-radius: 8px;

  &__card {
    background-color: #fff;
    padding: 1.5rem 2rem;
    border-radius: 4px;
  }
}

</style>